TexasInstruments/Beyond-SDK/am62x/MSPM0-ADC-RTC-Attach/MSPM0-ADC-Attach-SPI/Multi Byte Single Channel SPI/Peripheral/MSPM0/Debug/syscfg/ti_msp_dl_config.h
/*
 * Copyright (c) 2021, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0L130X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0L130X

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)


#define CPUCLK_FREQ                                                     32000000



/* Defines for TIMER_ADC */
#define TIMER_ADC_INST                                                   (TIMG0)
#define TIMER_ADC_INST_IRQHandler                               TIMG0_IRQHandler
#define TIMER_ADC_INST_INT_IRQN                                 (TIMG0_INT_IRQn)
#define TIMER_ADC_INST_LOAD_VALUE                                         (327U)
#define TIMER_ADC_INST_PUB_0_CH                                              (1)



/* Defines for SPI_0 */
#define SPI_0_INST                                                         SPI0
#define SPI_0_INST_IRQHandler                                   SPI0_IRQHandler
#define SPI_0_INST_INT_IRQN                                       SPI0_INT_IRQn
#define GPIO_SPI_0_PICO_PORT                                              GPIOA
#define GPIO_SPI_0_PICO_PIN                                       DL_GPIO_PIN_5
#define GPIO_SPI_0_IOMUX_PICO                                    (IOMUX_PINCM6)
#define GPIO_SPI_0_IOMUX_PICO_FUNC                    IOMUX_PINCM6_PF_SPI0_PICO
#define GPIO_SPI_0_POCI_PORT                                              GPIOA
#define GPIO_SPI_0_POCI_PIN                                       DL_GPIO_PIN_4
#define GPIO_SPI_0_IOMUX_POCI                                    (IOMUX_PINCM5)
#define GPIO_SPI_0_IOMUX_POCI_FUNC                    IOMUX_PINCM5_PF_SPI0_POCI
/* GPIO configuration for SPI_0 */
#define GPIO_SPI_0_SCLK_PORT                                              GPIOA
#define GPIO_SPI_0_SCLK_PIN                                       DL_GPIO_PIN_6
#define GPIO_SPI_0_IOMUX_SCLK                                    (IOMUX_PINCM7)
#define GPIO_SPI_0_IOMUX_SCLK_FUNC                    IOMUX_PINCM7_PF_SPI0_SCLK
#define GPIO_SPI_0_CS_PORT                                                GPIOA
#define GPIO_SPI_0_CS_PIN                                         DL_GPIO_PIN_3
#define GPIO_SPI_0_IOMUX_CS                                      (IOMUX_PINCM4)
#define GPIO_SPI_0_IOMUX_CS_FUNC                 IOMUX_PINCM4_PF_SPI0_CS1_POCI1



/* Defines for ADC */
#define ADC_INST                                                            ADC0
#define ADC_INST_IRQHandler                                      ADC0_IRQHandler
#define ADC_INST_INT_IRQN                                        (ADC0_INT_IRQn)
#define ADC_ADCMEM_0                                          DL_ADC12_MEM_IDX_0
#define ADC_ADCMEM_0_REF                         DL_ADC12_REFERENCE_VOLTAGE_VDDA
#define ADC_ADCMEM_0_REF_VOLTAGE                                              -1 // VDDA cannot be determined
#define ADC_INST_SUB_CH                                                      (1)
#define GPIO_ADC_C7_PORT                                                   GPIOA
#define GPIO_ADC_C7_PIN                                           DL_GPIO_PIN_18



/* Defines for DMA_CH0 */
#define DMA_CH0_CHAN_ID                                                      (0)
#define SPI_0_INST_DMA_TRIGGER                                (DMA_SPI0_RX_TRIG)



/* Port definition for Pin Group GPIO_LEDS */
#define GPIO_LEDS_PORT                                                   (GPIOA)

/* Defines for USER_LED_1: GPIOA.0 with pinCMx 1 on package pin 1 */
#define GPIO_LEDS_USER_LED_1_PIN                                 (DL_GPIO_PIN_0)
#define GPIO_LEDS_USER_LED_1_IOMUX                                (IOMUX_PINCM1)

/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_TIMER_ADC_init(void);
void SYSCFG_DL_SPI_0_init(void);
void SYSCFG_DL_ADC_init(void);
void SYSCFG_DL_DMA_init(void);



#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
